tutorials/simpleFoam/crossFlowTurbineAL/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "include/initialConditions"

internalField   uniform $turbulentEpsilon;

boundaryField
{
    // #include "include/ABLConditions"

    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           uniform 14.855;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    walls
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }

    top
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }

    bottom
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
/*
    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        Uref            $Uref;
        Href            $Href;
        z               $zDirection;
        z0              $z0;
        value           $internalField;
        zGround         $zGround;
    }

    ground
    {
        type            zeroGradient;
    }
*/
    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
