tutorials/simpleFoam/crossFlowTurbineAL/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

disk
{
    type            rotorDisk;
    active          on;            //on/off switch
    selectionMode   cellSet;       //cellSet // points //cellZone
    cellSet         actuatorDisk;//cellSet name when selectionMode = cellSet

    rotorDiskCoeffs
    {
        fieldNames      (U);    // names of fields on which to apply source
        nBlades         3;      // number of blades
        tipEffect       0.96;   // normalised radius above which lift = 0

        inletFlowType   local;  // inlet flow type specification
	inletVelocity   (0 1 0);

        geometryMode    specified;   // geometry specification

	origin          (0 0 0);
	axis		(0 1 0);

        refDirection    (0 0 1); // reference direction
                                  // - used as reference for psi angle
	rpm		1000;
	//pointAbove	(0 0 0.25);
	
        trimModel       fixedTrim;  // fixed || targetForce
	
	rhoRef		1000;
	
	rhoInf		1;
	

	fixedTrimCoeffs
	{
	     theta0	    0;
	     theta1c	    0;
	     theta1s        0;
	}

        flapCoeffs
        {
            beta0           0;  // coning angle [deg]
            beta1c          0;  // lateral flapping coeff (cos coeff)
            beta2s          0;  // longitudinal flapping coeff (sin coeff)
        }

        blade
        {
            data (
			(profile1 (0.1 -6 0.1))
			(profile1 (0.25 -6 0.1))

		 ); 
        }

        profiles
        {
            profile1
		{
		type lookup;
		data 	(
			(-90 0.21 1.45)
			(-18 0.21 1.45)
			(-16 0.165 1.3)
			(-14 0.125 1.1)
			(-12 0.092 0.95)
			(-10 0.07 0.8)
			(-8 0.05 0.64)
			(-6 0.04 0.5)
			(-4 0.028 0.32)
			(-2 0.022 0.18)
			(0 0.02 0)
			(2 0.022 0.18)
			(4 0.028 0.32)
			(6 0.04 0.5)
			(8 0.05 0.64)
			(10 0.07 0.8)
			(12 0.092 0.95)
			(14 0.125 1.1)
			(16 0.165 1.3)
			(18 0.21 1.45)
			(90 0.21 1.45)
			);
		}
        }
    }
}

// ************************************************************************* //
