tutorials/simpleFoam/crossFlowTurbineAL/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw; 

interpolationScheme cellPoint; 

sets 
 ( 
    profile_-1.22
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 -1.22);
        end         (1.0 1.83 -1.22);
        nPoints     41;
    }

    profile_-1.098
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 -1.098);
        end         (1.0 1.83 -1.098);
        nPoints     41;
    }

    profile_-0.976
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 -0.976);
        end         (1.0 1.83 -0.976);
        nPoints     41;
    }

    profile_-0.854
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 -0.854);
        end         (1.0 1.83 -0.854);
        nPoints     41;
    }

    profile_-0.732
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 -0.732);
        end         (1.0 1.83 -0.732);
        nPoints     41;
    }

    profile_-0.61
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 -0.61);
        end         (1.0 1.83 -0.61);
        nPoints     41;
    }

    profile_-0.488
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 -0.488);
        end         (1.0 1.83 -0.488);
        nPoints     41;
    }

    profile_-0.366
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 -0.366);
        end         (1.0 1.83 -0.366);
        nPoints     41;
    }

    profile_-0.244
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 -0.244);
        end         (1.0 1.83 -0.244);
        nPoints     41;
    }

    profile_-0.122
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 -0.122);
        end         (1.0 1.83 -0.122);
        nPoints     41;
    }

    profile_0.0
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 0.0);
        end         (1.0 1.83 0.0);
        nPoints     41;
    }

    profile_0.122
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 0.122);
        end         (1.0 1.83 0.122);
        nPoints     41;
    }

    profile_0.244
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 0.244);
        end         (1.0 1.83 0.244);
        nPoints     41;
    }

    profile_0.366
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 0.366);
        end         (1.0 1.83 0.366);
        nPoints     41;
    }

    profile_0.488
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 0.488);
        end         (1.0 1.83 0.488);
        nPoints     41;
    }

    profile_0.61
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 0.61);
        end         (1.0 1.83 0.61);
        nPoints     41;
    }

    profile_0.732
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 0.732);
        end         (1.0 1.83 0.732);
        nPoints     41;
    }

    profile_0.854
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 0.854);
        end         (1.0 1.83 0.854);
        nPoints     41;
    }

    profile_0.976
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 0.976);
        end         (1.0 1.83 0.976);
        nPoints     41;
    }

    profile_1.098
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 1.098);
        end         (1.0 1.83 1.098);
        nPoints     41;
    }

    profile_1.22
    { 
        type        uniform; 
        axis        y; 
        start       (1.0 -1.83 1.22);
        end         (1.0 1.83 1.22);
        nPoints     41;
    }

);

fields 
(
    U
    vorticity
); 

// *********************************************************************** // 
